Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: མི འི་ མ་ ལགས་པ འི་ འདོད་པ འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ གིས་ རྩེ་ ཞིང་ དགའ་ ལ་ དགའ་མགུ ར་ སྤྱོད་པ ར་ བགྱིད་ ཅིང་ ཡན་ལག་ ཐམས་ཅད་ ལས་ མེ་ཏོག་ ཀུན་ ཏུ་ རྒྱས་པ འི་ ཤིང་ ཡོངས་འདུ་ ས་བརྟོལ་ དུ་ རེག་ ནས་ |#| སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ དགའ་ བ ར་ འགྱུར །_
en: To their hearts’ content, they will enjoy and revel in superhuman sense pleasures, and touching that heavenly, wish-fulfilling tree in full bloom, they will be overjoyed.

source: བཅོམ་ལྡན་འདས་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ཀྱིས་ ཡོངས་འདུ་ ས་བརྟོལ་ ལ་ གནོད་པ ར་ བགྱི་བ འམ །_ སྨན་ གདགས་པ་ ཅི་ཡང་ མ་ བགྱིས་ ལགས་ མོད་ ཀྱི །_
en: Yet the gods of the Thirty-Three certainly neither benefit nor harm that perfect, wish-fulfilling tree in any way at all.

source: འོན་ཀྱང་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ཀྱིས་ འདོད་པ་ ལ་ ལོངས་སྤྱོད་ པར་ བགྱི་བ འི་ སླད་ དུ་ ཡན་ལག་ ཐམས་ཅད་ ལས་ མེ་ཏོག་ ཀུན་ ཏུ་ རྒྱས་པ འི་ ཤིང་ ཡོངས་འདུ་ ས་བརྟོལ་ གྱི་ ཐད་ དུ་ མངོན་པར་ མཆི་བ ར་ འོས་པ་ ལགས་པ་ དེ་བཞིན་ དུ །_
en: But to partake of their enjoyments the gods of the Thirty-Three are required to be near that perfect, wish-fulfilling tree, whose branches are all in full bloom. |#| $161 “Similarly,

source: བཅོམ་ལྡན་འདས་ བདག་ ལ་ སེམས་ཅན་ རྣམས་ ཀྱིས་ གནོད་པ ར་ བགྱི་བ འམ །_ སྨན་ གདགས་པ་ མ་ བགྱིས་ ལགས་ མོད་ ཀྱི་
en: Blessed One, by no means do sentient beings either harm or benefit me.

source: འོན་ཀྱང་ ཡེ་ཤེས་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ དེ་ བསྒྲུབས་ ཏེ
en: However, in terms of the accomplishment of wisdom, the wisdom of the buddhas,

source: ཡན་ལག་ ཐམས་ཅད་ ལས་ མེ་ཏོག་ ཀུན་ དུ་ རྒྱས་པ འི་ ཤིང་ ཡོངས་འདུ་ ས་བརྟོལ་ བཞིན་ དུ་ ཅི་ ནས་ ཀྱང་ སེམས་ཅན་ གྲངས་ མ་ མཆིས་ དཔག་ ཏུ་ མ་ མཆིས་པ་ དེ་དག་ མངོན་པར་ མཆི་བ འི་ འོས་ སུ་ བགྱི་བ འི་ སླད་ དུ་ སེམས་ ཅན་ རྣམས་ ཀྱི་ དོན་ དུ་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ འཚལ་ ལགས་ ཏེ །_
en: it is as in the analogy of that perfect wish-fulfilling tree in full bloom. |#| All these infinitely and innumerably many sentient beings must by all means be present. |#| Hence I don my armor for the sake of sentient beings.

source: དེ་ ལ་ ཡང་ སེམས་ཅན་ རྣམས་ དགའ་བ་ མ་ མཆིས་པ འི་ དེ་བཞིན་ གཤེགས་པ འི་ དབང་པོ་ ལྔ་པོ་ དག་ གིས་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ དག་ བཞིན་ དུ་ རྩེ་ ཞིང་ དགའ་ ལ་ དགའ་མགུ ར་ སྤྱོད་པ ར་ བགྱིད་ ལགས་སོ །_།
en: Moreover, by means of the five masteries of the thus-gone ones, who themselves are not subject to being pleased, sentient beings will experience joy. |#| Just like the gods of the Thirty-Three, they will be happy, frolic, and revel to their hearts’ content.

source: བཅོམ་ལྡན་འདས་ བདག་ཅག་ གིས་ གོ་ཆ་ དེ་ཡང་ སེམས་ཅན་ ལས་ དབེན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ བགོས་ ལགས་ ཀྱི །_ སེམས་ཅན་ དམིགས་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས །_
en: $162 “Blessed One, we bear our armor in order to disengage from sentient beings—not for the sake of observing them.

source: བདག་ ལས་ དབེན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ བགོས་ ལགས་ ཀྱི །_ བདག་ དམིགས་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས །_
en: We bear it for the sake of disengaging from the self—not for the sake of observing it.

source: ཆོས་ ལས་ དབེན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ བགོས་ ལགས་ ཀྱི །_ ཆོས་ དམིགས་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས །_
en: We bear it for the sake of disengaging from phenomena—not for the sake of observing them.

source: ཕུང་པོ་ ལས་ དབེན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ བགོས་ ལགས་ ཀྱི །_ ཕུང་པོ་ དམིགས་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས །_
en: We bear it for the sake of disengaging from the aggregates—not for the sake of observing them. [30.a]

source: ཁམས་ ལས་ [30a] དབེན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ བགོས་ ལགས་ ཀྱི །_ ཁམས་ དམིགས་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས །_
en: We bear it for the sake of disengaging from the elements—not for the sake of observing them.

source: སྐྱེ་མཆེད་ ལས་ དབེན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ བགོས་ ལགས་ ཀྱི །_ སྐྱེ་མཆེད་ དམིགས་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས་ ཏེ །_
en: We bear it for the sake of disengaging from the sense sources—not for the sake of observing them.

source: འདི་ལྟ་སྟེ །_ དབེན་པ འི་ གོ་ཆ་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ དེ་ བགོས་ ལགས་སོ །_།
en: Such is the armor of disengagement that we bear.

source: བཅོམ་ལྡན་འདས་ གོ་ཆ་ དེ་ ནི་ དབེན་པ འི་ གོ་ཆ་ ལགས་ ཏེ །_
en: $163 “Blessed One, this is an armor of disengagement.

source: དེ་ ལ་ ནི་ གོ་ཆ་ མ་ མཆིས་ གོ་ཆ འི་ འབྲས་བུ་ མ་ མཆིས་ ཏེ །_
en: It is not an armor and does not bring the results of an armor.

source: གང་ཡང་ ཐོབ་པ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས །_ དོར་བ ར་ བགྱི་བ འི་ སླད་ དུ་མ་ ལགས་པ་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ དེ་ བགོས་ ལགས་སོ །_།
en: Hence, it is not worn for the sake of obtaining anything at all. |#| Neither is it worn for the sake of giving up anything. |#| We do not think of it as an armor, or assert it to be so.

source: བདག་ འདི་ ནི་ གོ་ཆ འོ་ ཞེས་ མོས་པ ར་ མི་ བགྱིད་ ཅིང་ གཡར་ གྱིས་ མི་ ལེན་པ་ དང་ །_ གོ་ཆ་ འདི་ ནི་ འདི་ ལྟ་བུ འོ་ ཞེས་ གཡར་ གྱིས་ མི་ ལེན་པ་ དང་ །_ ཚད་ དེ་ལྟ་ བུ འོ་ ཞེས་ གཡར་ གྱིས་ མི་ ལེན་པ་ དང་ །_ གོ་ཆ་ འདི་ ནི་ འདི འི་ ཕྱིར་ རོ་ ཞེས་ གཡར་ གྱིས་ མི་ ལེན་པ་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ དེ་ བགོས་ ལགས་སོ །_།
en: We do not assert it to be in any particular way, as having any particular extent, or as having any particular purpose. |#| Such is the armor that we bear.

source: བཅོམ་ལྡན་འདས་ གལ་ཏེ་ གཡར་ གྱིས་ བླངས་ ན་ |#| ནི་ བདག་ ཉེ་བ ར་ བླངས་པ ར་ འགྱུར་བ་ ཞིག་ ན །_
en: $164 “Blessed One, if we were to assert the armor in any way, we would also perpetuate the self. |#| But,

source: བཅོམ་ལྡན་འདས་ བདག་ ཉེ་བ ར་ མི་ ལེན་ ལགས་ ཏེ །_
en: Blessed One, we do not perpetuate the self.

source: དེ་ ཉེ་བ ར་ མི་ ལེན་ ཅིང་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ བདག་ གམ་ བདག་ མ་ མཆིས་པ་ ལ་ མི་ གནས་པ འི་ སླད་ དུའོ །_།
en: We do not perpetuate it; |#| bodhisattvas do not apprehend there being or not being a self.

source: བཅོམ་ལྡན་འདས་ གལ་ཏེ་ བདག་ མ་ མཆིས་པ་ ལ་ གནས་ ན་ |#| ནི་ བདག་ ཁོ་ན་ ལ་ གནས་པ ར་ འགྱུར་བ་ ཞིག་ ན །_
en: Blessed One, if there is abiding on there not being a self, that implies nothing but abiding on the existence of a self.

source: བཅོམ་ལྡན་འདས་ ཆོས་ ཐམས་ཅད་ མི་ གནས་པ འི་ སླད་ དུའོ །_།
en: This is because, Blessed One, all phenomena are beyond abiding.

source: བཅོམ་ལྡན་འདས་ འཇིག་རྟེན་ དུ་ གོ་ཆ་ དེ་དེ་ ལྟར་ རབ་ཏུ་ བསྒོམས་པ་ ལགས་ ཏེ །_
en: Blessed One, this is how we train with our armor in the world.

source: བཅོམ་ལྡན་འདས་ ཇི་ལྟ ར་ ཅི་ཡང་ མ་ བསྒོམས་པ་ དེ་ལྟ ར་ རབ་ཏུ་ བསྒོམས་པ་ ལགས་པ འི་ སླད་ དུའོ །_།
en: That is to say, this is not a training in anything at all.”

source: གཞན་ ཡང་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བཟང་སྐྱོང་ གིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $165 The bodhisattva great being Bhadrapāla then spoke as follows to the Blessed One:

source: བཅོམ་ལྡན་འདས་ བདག་ གིས་ སོ་སོ འི་ སྐྱེ་ བོ འི་ ཆོས་ རྣམས་ ཐག་ རིང་ ཞེས་ བགྱི་ བར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ཞིང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ ཐག་ ཉེ་ ཞེས་ བགྱི་ བར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ །_
en: “Blessed One, I do not perceive the qualities of ordinary persons to be ‘far away,’ nor do I perceive the qualities of the buddhas to be ‘nearby.’

source: སློབ་པ འི་ ཆོས་ རྣམས་ ཐག་ རིང་ ཞེས་ བགྱི་ བར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ཞིང་ །_
en: I do not perceive the qualities of training to be ‘distant,’ [30.b]

source: སངས་རྒྱས་ ཀྱི་ ཆོས་ [30b] རྣམས་ ཐག་ ཉེ་ ཞེས་ བགྱི་ བར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ །_
en: nor do I perceive the qualities of the buddhas to be ‘close.’

source: སངས་རྒྱས་ ཀྱི་ ཆོས་ དེ་དག་ ཅེས་ དེ་ལྟ ར་ ཡང་ཡང་ དག་པ ར་ རྗེས་སུ་ མ་ མཐོང་ ཞིང་ །_
en: I do not perceive such a thing as ‘the qualities of buddhahood,’

source: སངས་རྒྱས་ ཀྱི་ ཆོས་ དེ་དག་ དེ་བཞིན་ ཞེས་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ལགས་ ཏེ །_
en: nor do I perceive in terms of anything being ‘in accord with the qualities of buddhahood.’

source: བཅོམ་ལྡན་འདས་ བདག་ གིས་ ཕན་ ཡོན་ ཅི་ཡང་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ཞིང་ ཉེས་དམིགས་ ཅི་ཡང་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་བ་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ བགོས་ ལགས་ ཏེ །_
en: Blessed One, I neither perceive any benefits, nor do I perceive any flaws. |#| Such is the armor that I have donned.

source: འཇིག་རྟེན་ དུ་ གོ་ཆ་ དེ་དེ་ ལྟར་ རབ་ཏུ་ བགོས་པ་ ལགས་སོ །_།
en: Such is the armor that I bear in the world.”

source: དེ་ནས་ བཟང་སྐྱོང་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལྔ་ བརྒྱ ས་ བཅོམ་ ལྡན་འདས་ ལ་ པད་མ་ གང་དག་ གཏོར་བ་ དེ་དག་ ཕྱོགས་ བཅུ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དག་ ཏུ་ དོང་ ནས
en: $166 Bhadrapāla and the others among the five hundred bodhisattvas who had tossed the lotus flower before the Blessed One then journeyed out into the worlds of the ten directions.

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ སྟེང་ དུ་ ཆར་ བབ་ ཅིང་ སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ ར་ ཡང་ བྱས་ སོ །།_།།
en: They let a rain fall on the blessed buddhas, and they brought sentient beings to maturation.

source: ཡང་ དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ དེ འི་ ཕ་རོལ་ གྱི་ ཡང་ ཆེས་ ཕ་རོལ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཚན་ གྱི་ གཟི་བརྗིད་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མཚན་མ་ མེད་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ
en: $167 At that time there was in the east, beyond countless and innumerable universes, a universe known as Marks of Royal Splendor, and within that universe resided a thus-gone one, a worthy one, a perfect buddha called Roar of Signlessness.

source: བཅོམ་ལྡན་འདས་ དེས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ཞེས་ བྱ་བ་ འདི་ ནི་ ང འི་ འོག་ ཏུ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་ པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ་ ཞེས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that following himself the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin would awaken to unsurpassable and perfect buddhahood.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ ཞིང་ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ ཏེ །_ |#| དེ་ ཐོས་ ནས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ མཚན་མ་ མེད་པ འི་ ང་རོ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $168 Now, having seen the great light and heard the special sound, the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin addressed the blessed thus-gone Roar of Signlessness:

source: བཅོམ་ལྡན་འདས་ འོད་ གདའ་བ་ འདི་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ འདི་ སུ འི་ ལགས །_
en: “Blessed One, from whence comes this special sound, and what is the source of this great illumination?”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ [31a] བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied the Blessed One to the bodhisattva great being, [31.a]

source: སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ དེ འི་ ཕ་རོལ་ གྱི་ ཡང་ ཆེས་ ཕ་རོལ་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $169 “Saha­cittotpāda­dharma­cakra­pravartin,” |#| “west of this buddha realm, beyond countless and innumerable world realms, there is a universe known as Enduring.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: Within that universe resides the thus-gone one Śākyamuni.

source: འཚོ་ ཞིང་ གཞེས་ ལ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཚོམ་ གཅོད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏེ
en: Abiding and remaining present there, he is delivering a Dharma teaching that belongs to the Bodhisattva Collection and is known as ‘Truly Satisfying All Sentient Beings by Eliminating Their Doubts.’

source: འོད་ དེ་ དང་ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ ནི་ དེ འི་ ཡིན་ ནོ །_།
en: That is the source of the light and the distinctive sound.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པ་ དག་ མཚམས་ སུ་ ལྷགས་ སོ །_།
en: In that buddha realm have arrived, within the circle of the retinue, infinite and unfathomable bodhisattva great beings who bear the inconceivable armor.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $170 In response, the bodhisattva said to that blessed one,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་ བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to visit that universe so that I may see, venerate, and serve the blessed thus-gone Śākyamuni.

source: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ཀྱང་ བལྟ་བ ར་ བགྱི འོ །_།
en: I also wish to see those bodhisattvas.

source: སེམས་ཅན་ དེ་ལྟ་ བུ་ དེ་དག་ ཐོས་པ ར་ ཡང་ ཤིན་ཏུ་ དཀའ་ ལགས་ ན་ ལྟ་བ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ འཚལ་ ཞིང་ བསྙེན་བཀུར་ བགྱི་བ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ འཚལ་བ འི་ སླད་ དུའོ །_།
en: Because it is hard to even hear about such beings. |#| Needless it is, then, to mention how difficult it is to behold and venerate them.”

source: དེ་ནས་ དེ་བཞིན་ གཤེགས་ པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མཚན་མ་ མེད་པ འི་ ང་རོ ས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $171 The thus-gone one, the worthy one, the perfect buddha Roar of Signlessness then said to the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin,

source: རིགས་ ཀྱི་ བུ་ དེ འི་ དུས་ ལ་ དབབ་པ ར་ ཤེས་ ན་ |#| སོང་ ཤིག _།
en: “Noble son, if you know that the time has come, then go.

source: དེ་ བཞིན་ གཤེགས་པ ས་ སྐབས་ ཕྱེ་བ ས །_ དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ སྟན་ ལས་ ལངས་ ནས་
en: The Thus-Gone One grants you permission.” |#| $172 The bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin then rose from his seat.

source: བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ |#| བསྐོར་བ་ ཡང་ བྱས་ ནས་
en: He bowed his head to the feet of that blessed one and circumambulated him.

source: སོང་ སྟེ |#| བཅོམ་ལྡན་འདས་ [31b] ཀྱིས་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ཁྱོད་ ཀྱིས་ པད་མ་ འདི་ ང འི་ ཚིག་ གིས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ ཕུལ་ ཅིག་ ཅེས་ དེ འི་ ལག་ ཏུ་ པད་མ་ གཅིག་ བྱིན་ ནོ །_།
en: Upon his departure, [31.b] the Blessed One then placed a lotus flower in the bodhisattva’s hand and told him, “Saha­cittotpāda­dharma­cakra­pravartin, you must offer this lotus flower to the blessed thus-gone Śākyamuni on my behalf.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ ལོ་ བསྐོར་བ ས་ པད་མ་ དེ་ ལག་པ ས་ བླངས་ ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དུ་ འོངས་ སོ །_།
en: $173 Thus, the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin came to the world of Enduring with that lotus flower in his hand.

source: པད་མ་ ཆེན་པོ་ དེ་ལས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མཚན་མ་ མེད་པ འི་ ང་རོ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྤྱད་པ་ སྤྱོད་པ་ ན་ འཁོར་ ཁྱད་པར་ དུ་ འཕགས་པ་ གང་དག་ བྱུང་བ ར་ གྱུར་པ་ དེ་དག་ ཐམས་ཅད་ ཀུན་ ཏུ་ སྣང་ སྟེ
en: Then, from that great lotus flower appeared all the superior beings who had been part of the retinue of the thus-gone one, the worthy one, the perfect buddha Roar of Signlessness, when he engaged in bodhisattva activity.

source: སེམས་ཅན་ དེ་དག་ གིས་ ལོངས་ སྤྱད་པ ར་ བྱ་བ འི་ ཕྱིར་ པད་མ་ ཆེན་པོ་ དེ་ལྟ་ བུ་ དག་ གིས་ ཀྱང་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ཁྱབ་བོ །_།
en: Moreover, so that this could be experienced by the sentient beings there, similar such great lotus flowers now spread throughout the universe.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ པད་མ་ དེ་ ཐོགས་ ནས |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དུ་ སོན་ ཏོ །_།
en: $174 Holding the lotus flower, the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin thus came to the universe known as Enduring.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ དེ་ ཕྱིན་ ནས །_ |#| དེ་ནས་ དེ་ མ་ ཐག་ ཏུ་ དེ་ཉིད་ ཀྱི་ ཚེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ ན་ ཤིང་ ལྗོན་པ འི་ རྣམ་པ འམ །_ འབྲས་བུ འི་ རྣམ་པ འམ །_ མེ་ཏོག་ གི་ རྣམ་པ འམ །_ ལོ་མ འི་ རྣམ་པ་ ཇི་སྙེད་ ཡོད་པ་ དང་ །_ ཐ་ན་ སོར་ བཞི་ ཙམ་པ་ དེ་ ཐམས་ཅད་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འི་ ལག་པ་ ལས་ ཀུན་ ཏུ་ སྣང་ངོ་ །_།
en: At the very moment he arrived there, all the trees, fruits, flowers, and leaves that existed in Enduring—down to the size of just four finger widths—appeared from Saha­cittotpāda­dharma­cakra­pravartin’s hand.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ ན་ སེམས་ཅན་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ གིས་ རང་རང་ གི་ སྐད་ དག་ མངོན་པར་ བརྗོད་ དེ |#| དེ་དག་ མངོན་པར་ བརྗོད་པ་ ན་ མི་རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ བདག་མེད་པ འི་ སྒྲ་ གྲག་ ཅིང་ །_
en: Moreover, in each of their own languages all beings in Enduring began to speak of impermanence, suffering, and the absence of self.

source: དབང་པོ་ དང་ །_ སྟོབས་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ །_ བསམ་གཏན་ དང་ །_ རྣམ་ པར་ ཐར་པ་ དང་ །_ ཏིང་ངེ་འཛིན་ དང་ །_ སྙོམས་པ ར་ འཇུག་པ འི་ སྒྲ་ དག་ ཀྱང་ གྲག་ གོ །_།
en: They also spoke of the masteries, the powers, the branches of awakening, the concentrations, the liberations , the absorptions, and the attainments.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $175 Witnessing all this, the venerable Śāradvatī­putra exclaimed,

source: ཨ་ལ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱི་ རྫུ་འཕྲུལ་ [32a] མངོན་པར་ འདུ་ མཛད་པ་ ཆེན་པོ་ འདི་ ཀུན་ ཏུ་ གདའ་ ལགས་སོ །_།
en: “Ah, how wondrous that the Thus-Gone One, the Foe-Destroyer, the perfect Buddha performs such miracles!” [32.a]

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: said the Blessed One,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་བྱེད་པ་ འདི་ ནི་ དེ་བཞིན་ གཤེགས་ པ འི་ མ་ ཡིན་ ཏེ །_
en: $176 “Śāradvatī­putra,” |#| “these miracles are not of the Thus-Gone One.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་བྱེད་པ་ འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འི་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, these are the miracles of the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ ཤར་ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མཚན་ གྱི་ གཟི་བརྗིད་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: Śāradvatī­putra, to the east of this buddha realm, beyond innumerable and countless universes, there is a universe known as Marks of Royal Splendor.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མཚན་མ་ མེད་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ །_
en: Within that universe resides the thus-gone one, the worthy one, the perfect buddha Roar of Signlessness.

source: འཚོ་ ཞིང་ གཞེས་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ཞེས་ བྱ་བ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འོངས་ ཏེ །_
en: From the realm where that buddha abides and remains present the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin has arrived.

source: བྱང་ཆུབ་ སེམས་དཔའ་ དེ འི་ སྔོན་ གྱི་ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ ས་ འདི་སྣང་ ངོ་ །_།
en: All this appears due to the ripening of that bodhisattva’s past actions.”

source: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ དགེ་བ འི་ རྩ་བ་ ཇི་སྙེད་ ཅིག་ བསགས་ ཤིང་ དགེ་བ འི་ རྩ་བ་ གང་དག་ བསགས་པ ས་ བྱང་ ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འི་ རྣམ་པར་ སྨིན་པ ར་ ཡོངས་སུ་ སྦྱང་བ་ དེ་ལྟ་ བུ་ དེ་དག་ ཀུན་ དུ་ གདའ་ ལགས །_
en: $177 “Blessed One,” |#| “which numerous roots of virtue did the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin gather, so that he now, through their ripening, has achieved such mastery?”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ ལ་དོན་ དེ་ དྲི་བ ར་ སེམས་པ་ ནི་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: $178 “Śāradvatī­putra,” |#| “it is excellent that you thought to ask the Thus-Gone One about this matter.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ འི་ མཐུ་ ཁོ་ན ས་ ཁྱོད་ ཀྱི་ སྤོབས་པ་ དེ་ཡང་ སྐྱེས་པ་ ཡིན་ ཏེ །_
en: Śāradvatī­putra, such eloquence is exclusively due to the power of the Thus-Gone One.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཕྱིར་ ཉོན་ ཅིག་ དང་ ངས་ ཁྱོད་ ལ་ བཤད་ དོ །_།
en: Listen, Śāradvatī­putra, I shall explain this to you. [32.b]

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ [32b] དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ ཏེ །_ |#| བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ དམ་པ་ ན་ བཞུགས་པ་ ཇི་སྙེད་ བྱུང་བ་ ལ །_ སྔོན་ ཐོག་མ ར་ ཆོས་ བསྐུལ་བ་ བྱས་ ཤིང་ གསོལ་བ་ བྱས་ ཏེ །_
en: When all the blessed buddhas in the past awoke to perfect buddhahood and resided upon the seat of awakening, the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin was the one who initially supplicated them and requested them to teach.

source: འདི ས་ སྔོན་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ཚོགས་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ དག་ བསྐྱེད་ དེ །_
en: This is how he accumulated the virtuous roots for unsurpassable and perfect awakening.

source: དེ་དག་ གི་ ཐད་ དུ་ སོང་ ནས་ |#| ཁ་ཅིག་ ལ་ ནི་ ཚངས་པ ར་ གྱུར་པ ས་ བསྐུལ་བ་ བྱས་ ཤིང་ གསོལ་བ་ བཏབ་བོ །_།
en: As he went before them, he would sometimes become Brahmā and so make requests and supplicate.

source: དེ་དག་ གི་ ཐད་ དུ་ སོང་ ནས་ |#| ཁ་ཅིག་ ལ་ ནི་ བརྒྱ་བྱིན་ དུ་ གྱུར་པ་ དང་ །_ ཁ་ཅིག་ ལ་ ནི་ འཁོར་ལོ ས་ སྒྱུར་བ ར་ གྱུར་པ་ དང་ །_ ཁ་ཅིག་ ལ་ ནི་ རྒྱལ་པོ་ དྲང་སྲོང་ དུ་ གྱུར་པ ས་ བསྐུལ་བ་ བྱས་ ཤིང་ གསོལ་བ་ བཏབ་བོ །_།
en: Other times he would do so in the form of Śakra, universal emperors, kings, or sages.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ་ དཔེར་ན །_ |#| ང་ ཐོག་མ ར་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ ནས་
en: $179 “For example, Śāradvatī­putra, when I had first awoken to true and perfect buddhahood,

source: ཚངས་པ་ ཆེན་པོ ས་ སེམས་ཅན་ ལས་ ཀྱི་ སྒྲིབ་པ་ ཆུང་ངུ་ དང་ ལྡན་པ་ དག་ མཆིས་ ཏེ །_ |#| ཆོས་མ་ ཐོས་པ་ དག་ ལས་ ཉམས་ ཤིང་ བཅོམ་ལྡན་འདས་ ཀྱི་ བཀའ་ བཞིན་ དུ་ བགྱིད་པ ར་ ཡང་ འགྱུར་ ན །_ |#| བཅོམ་ལྡན་འདས་ ཆོས་ བསྟན་ དུ་ གསོལ །_ |#| བདེ་བ ར་ གཤེགས་པ་ ཆོས་ བསྟན་ དུ་ གསོལ་ ཞེས་ ཆོས་ ཀྱི་ འཁོར་ལོ་ རབ་ཏུ་ བསྐོར་བ འི་ ཕྱིར་ བསྐུལ་ ཅིང་ གསོལ་བ་ བཏབ་པ་ དེ་བཞིན་ དུ །_
en: Mahābrahmā invoked and supplicated me, saying, ‘There are beings whose karmic obscurations are minor, who suffer from not having heard the Dharma, and who act in accord with the teachings of the thus-gone ones. |#| Blessed One, please therefore teach the Dharma. |#| Bliss-Gone One, please turn the wheel of Dharma.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ ཇི་སྙེད་ བྱུང་བ་ ལ་ བཅོམ་ལྡན་འདས་ ཆོས་ བསྟན་ དུ་ གསོལ །_ |#| བཅོམ་ལྡན་འདས་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་ དུ་ གསོལ་ ཞེས་ བསྐུལ་ ཅིང་ གསོལ་བ་ བཏབ་བོ །_།
en: Śāradvatī­putra, the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin has invoked and supplicated all the past buddhas in the same way, requesting them, ‘Please teach the Dharma. |#| Please turn the wheel of Dharma.’

source: འདི ས་ དགེ་བ འི་ རྩ་བ་ གང་དག་ བསགས་པ་ དེ་དག་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ར་ གསོལ་བ་ གདབ་པ་ མ་གཏོགས་ པར་ གང་ དུ་ ཡང་ ཡོངས་སུ་ མ་ བསྔོས་ ཏེ
en: All the roots of virtue that he gathered he has dedicated exclusively to the supplication for the turning of the wheel of Dharma.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཕྱིར་ དོན་ དེ་ རབ་ཏུ་ གྲུབ་པ ར་ བྱ་ བ འི་ ཕྱིར་ ཁྱོད་ ལ་ དཔེ་ བྱ་ སྟེ །_
en: $180 “Śāradvatī­putra, let me provide you with an illustration that establishes this point fully.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ནི་ གདན་ ཟླ་བ་ ཐེར་འབུམ་ དང་ །_ ཉི་མ་ ཐེར་འབུམ་ རྒྱུ་ ཞིང་ གླིང་ཆེན་པོ་ བཞི་པ འི་ འཁོར་རྒྱ་ མཚོ་ཆེན་པོ་ ཐེར་འབུམ་ ཕྲག་ བཞི་ དང་ །_ གླིང་བཞི་པ་ ཐེར་འབུམ་ ཕྲག་ བཞི་ དང་ །_ གླིང་ [33a] ཁྲག་ཁྲིག་ ཕྲག་ བདུན་ཅུ་ དང་ །_ འཁོར་ རི འི་ རྒྱལ་པོ་ རི་རབ་ ཐེར་འབུམ་ དང་ །_ ནང་ གི་ ཁོར་ཡུག་ ཐེར་འབུམ་ ཡོད་པ་ སྟེ །_
en: Within this trichiliocosm a billion suns and moons are in movement. |#| Four billion oceans surround the continents, of which there are likewise four billion. [33.a] There are seven billion islands, a billion tall surrounding mountains, and a billion inner circles of mountains.
